# -*- encoding: utf-8 -*-
'''
@File : homework1.8.py
@Time : 2020/03/06 13:13:08
@Author : xdbcb8 
@Version : 1.0
@Contact : xdbcb8@qq.com
@WebSite : www.xdbcb8.com
'''

# here put the import lib
#工号，姓名，工龄，工资
emp = ({'工号':'01','姓名':'王某','工龄':'2年','工资':2000},
{'工号':'02','姓名':'张某','工龄':'3年','工资':3000},
{'工号':'03','姓名':'赵某','工龄':'4年','工资':8000},
{'工号':'04','姓名':'孙某','工龄':'1.5年','工资':5000},
{'工号':'05','姓名':'李某','工龄':'1年','工资':1500},
{'工号':'06','姓名':'钱某','工龄':'3年','工资':3500},
{'工号':'07','姓名':'薛某','工龄':'5年','工资':7600},
{'工号':'08','姓名':'毛某','工龄':'1年','工资':3500},
{'工号':'09','姓名':'陈某','工龄':'4年','工资':10000},
{'工号':'10','姓名':'康某','工龄':'2年','工资':3600},)
free = [emp[x]['工资'] for x in range(0,10)]
free.sort()
for i in range(0,10):
    for j in range(0,10):
        if free[i] == emp[j]['工资']:
            print(emp[j])

